'use strict';

// 1. Зайдите в консоль своего браузера. При помощи оператора определения типа уточните тип следующих величин: «Привет», 123, true, «true».
// console.log(typeof 'привет');
// console.log(typeof 123);
// console.log(typeof true);
// console.log(typeof 'true');

// 2. Зайдите в консоль своего браузера. При помощи математических операторов (сложение, вычитание и т.д.) найдите значения выражений: 5 + 3, 5 — 3, 5 * 3, 5 / 3.
// console.log(5 + 3, 5 - 3, 5 * 3, 5 / 3);

// 3. Зайдите в консоль своего браузера. При помощи оператора нахождения остатка от деления %, найдите значения выражений: 5 % 3, 3 % 5.
// console.log(5 % 3, 3 % 5);

// 4. Зайдите в консоль своего браузера. При помощи оператора + (сложение, склеивание) найдите значения выражений: 5 + ‘3’ , ‘5’ — 3, 75 + ‘кг’.
// console.log(5 + '3', '5' - 3, 75 + 'kg');

// 5. Создайте переменные строкового, числового и булева типов. Выведите их содержимое.
// const num = 5;
// const str = 'str';
// const bl = true;
// console.log(num,str,bl);

// 6. Напишите скрипт, который находит площадь прямоугольника длиной 23см., шириной 10см.
// const d = 23;
// const sh = 10;
// const result = 23*10;
// console.log(result);

// 9) Створіть змінну num і надайте їй значення 3. Виведіть значення цієї змінної на екран за допомогою методу alert
// const i = 3;
// alert(i)

// 10) Створіть змінні a = 10 і b = 2. Виведіть на екран їх суму, різницю, добуток і частку (результат ділення)
// const a = 10;
// const b = 2;

// console.log(a+b);
// console.log(a%b);
// console.log(a-b);

// 11) Створіть змінні c = 15 і d = 2. Підсумуйте їх, а результат надайте змінної result. Виведіть на екран значення змінної result
// const c =15;
// const d = 2;

// const result = c-d;
// console.log(result);

// 12) Створіть змінні a = 10, b = 2 і c = 5. Виведіть на екран їх суму.
// const a = 10;
// const b = 2;
// const c = 5;

// console.log(a + b + c);

// 13) Створіть змінні a = 17 і b = 10. Відніміть від a змінну b і результат надайте зміннії c.
// Потім створіть змінну d, надайте їй значення 7. Складіть змінні c і d, а результат запишіть в змінну result.
// Виведіть на екран значення змінної result.

// const a = 17;
// const b = 10;

// const c = a - b;
// const d = 7;
// const result = c + d;
// console.log(result);

// 14) Запитайте ім'я користувача за допомогою методи prompt. Виведіть за допомогою alert повідомлення 'Ваше ім'я
// %значення що отримали з prompt%'
// const userInput =  prompt('your name');
// console.log(`your name ${userInput}`);

// 15) Створіть три змінні - година, хвилина, секунда. З їх допомогою виведіть поточний час в форматі 'година: хвилина: секунда'.
//  const hours = 20;
//  const min = 46;
//  const sec = 10;
//  console.log(`${hours}:${min}:${sec}`);

// 16) Створіть змінну, надайте їй число. Зведіть це число в квадрат. Виведіть його на екран
// let num;
// num = 2;
// console.log(num*2);

// 17) Переробіть цей код так, щоб в ньому використовувалися операції + =, - =, * =, / =. Кількість рядків коду при цьому не повинно змінитися.

//   var num = 47;
//   num += 7;
//   num -= 18;
//   num *= 10;
//   num /= 15;
//   console.log(num);

// 18) Створіть змінну str і надайте їй значення 'Hello World'. Виведіть значення цієї змінної на екран
// const str = 'hello word';
// console.log(str);

// 19) Створіть змінні str1 = 'Hello,' і str2 = 'World!'. За допомогою цих змінних і операції додавання рядків виведіть на екран фразу 'Hello World'.
// const str1 = 'hello';
// const str2 = 'word';
// console.log(str1 +" "+ str2);
// 20) Створіть змінну name і надайте їй ваше ім'я. Створіть змінну age і надайте їй ваш вік. Виведіть на екран 'Привіт, я  % Ім'я%!'Мені% Вік% років!'.
// const name = 'tony';
// const age = 20;
// console.log(`my name is ${name} my age ${age}`);
// 21) Створіть змінну str і надайте їй значення 'abcde'. Звертаючись до окремих символів цього рядка виведіть на екран символ 'a', символ 'c', символ 'e'
// const str = 'abcde'
// console.log(str[0]);
// console.log(str[1]);
// console.log(str[2]);
// console.log(str[3]);
// console.log(str[4]);

// 23) Дана рядок 'js'. Зробіть з неї рядок 'JS'.
// const str = 'js';
// console.log(str.toUpperCase());

// 24) Дана рядок 'JS'. Зробіть з неї рядок 'js'
// const str = 'js';
// console.log(str.toLowerCase());

// 25) Дана рядок 'я вчу javascript!'. Знайдіть кількість символів в цьому рядку.

// const str = 'я вчу javascript!';
// console.log(str.length);

// 26) Даны переменные a = 10 и b = 3. Найдите остаток от деления a на b.
// const a = 10;
// const b = 3;
// console.log(a%b);

// 27) Возведите 2 в 10 степень. Результат запишите в переменную st.
// console.log(Math.pow(10,2));

// 28) Найдите квадратный корень из 245.

// console.log(Math.sqrt(245));

// 29) Найдите квадратный корень из 379. Результат округлите до целых, до десятых, до сотых. (toFixed(0))
// const kor = Math.sqrt(379);
// console.log(kor.toFixed(0));
// console.log(kor.toFixed(1));
// console.log(kor.toFixed(2));
// console.log(kor.toFixed(3));
// const round = Math.round(kor)

// 30) Найдите квадратный корень из 587. Округлите результат в большую и меньшую стороны (edited)
// Перечень методов для работы со строками

// const kor = Math.sqrt(587)
// console.log(kor);
// console.log(Math.ceil(kor));
// console.log(Math.floor(kor));

////////////////////////////////////////IF ELSE////////////////////////////////////

//==================== task 03 ======================

/*Задача. В переменной min лежит число от 0 до 59. Определите в какую четверть часа попадает это число (в первую, вторую, третью или четвертую).*/
// const min = 10;

// if (min <= 30) {
//   console.log('1');
// } else if (min > 15 && min <= 30) {
//   console.log('2');
// } else if (min > 30 && min <= 45) {
//   console.log('3');
// } else if (min > 45 && min <= 60) {
//   console.log('4');
// }

//===================== task 09 =====================

/* 
  В переменную value записывается случайное число.
  
  Объяви переменную type, в которую, используя ветвления запиши строку:  
    - "even" если value четное
    - "odd" если value не четное
  PS: попробуй использовать тернарный оператор
*/

// const value = Number.parseInt(Math.random() * 100);

// let type;

// if (value % 2 === 0) {
//   type = 'even';
// } else {
//   type = 'odd';
// }

// console.log(`${value} is ${type}`);

//========================     Работа с if-else ========

//  Если переменная a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.

// const a = 0;
// const us = a === 0 ? 'yes' : 'nou';
// console.log(us);

//  Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.

// const a = -2;
// const us = a > 0 ? 'yes' : 'nou';
// console.log(us);

//  Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.

// const a = 10;
// const us = a < 0 ? 'yes' : 'nou';
// console.log(us);

//  Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.

// const a = -1;
// const us = a >= 0 ? 'yes' : 'nou';
// console.log(us);
//  Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.

//  Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.

//  Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 'test', 'тест', 3.

//  Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном '1', 1

// =============================   Работа с && (и) и || (или)

//  Если переменная a больше нуля и меньше 5-ти, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 5, 0, -3, 2.

//  Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной на экран. Проверьте работу скрипта при a, равном 5, 0, -3, 2.

//  Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания). Проверьте работу скрипта при a и b, равном 1 и 3, 0 и 6, 3 и 5.

//  Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.

//====================== Additional tasks ==========

/* В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
 В переменной month лежит какое-то число из интервала от 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).
 Дана строка, состоящая из символов, например, 'abcde'. Проверьте, что первым символом этой строки является буква 'a'. Если это так - выведите 'да', в противном случае выведите 'нет'.
 Дана строка с цифрами, например, '12345'. Проверьте, что первым символом этой строки является цифра 1, 2 или 3. Если это так - выведите 'да', в противном случае выведите 'нет'.
 Дана строка из 3-х цифр. Найдите сумму этих цифр. То есть сложите как числа первый символ строки, второй и третий.
 Дана строка из 6-ти цифр. Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр. Если это так - выведите 'да', в противном случае выведите 'нет'.
 
 */

//================== *plus task ============

//  Создайте программу, которая выводит надбавку за стаж. Пользователь вводит стаж работы, а программа пишет ему надбавку.

/*Стаж от	Стаж до	Надбавка
0	3 лет	0%
3 лет	10 лет	10%
10 лет	20 лет	20%
20 лет	выше	25%*/
